# Panads using to data analysis
    Series
    dataFrames
    Missing Data
    GroupBy
    Merging, joining and concatenating
    Operations
    Data Input and Output

In [143]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [144]:
lst = ['m','a','n','i']

In [145]:
pd.Series(lst)

0    m
1    a
2    n
3    i
dtype: object

In [146]:
lst2 = ['a','b','c','d']

In [147]:
pd.Series(data = lst, index=lst2)

a    m
b    a
c    n
d    i
dtype: object

In [148]:
pd.Series(lst, lst2)

a    m
b    a
c    n
d    i
dtype: object

In [149]:
Programming = ['c','c++','Python','java']

index = pd.Series(data = Programming, index = [1,2,3,4])

print(index)

1         c
2       c++
3    Python
4      java
dtype: object

In [150]:
ser1= pd.Series([1, 2, 6, 4], index = ['c', 'c++', 'python', 'java'])
ser1

c         1
c++       2
python    6
java      4
dtype: int64

In [151]:
ser2= pd.Series([5, 3, 2, 2], index = ['c', 'java', 'python', 'javascript'])
ser2

c             5
java          3
python        2
javascript    2
dtype: int64

In [152]:
ser1 + ser2

c             6.0
c++           NaN
java          7.0
javascript    NaN
python        8.0
dtype: float64

# DataFrames

In [153]:
df = pd.DataFrame(randn(5,5), index = '1 2 3 4 5'.split(), columns = ['A','B','C','D','E'])

In [154]:
df

          A         B         C         D         E
1  0.913668 -0.784681 -1.280079  0.453169  0.538182
2 -0.548434 -0.269612 -0.776509 -0.120699 -0.454400
3  0.710297 -0.649172 -0.056867  0.482628 -0.778616
4 -0.579512  0.551059 -1.241567  0.921067 -0.750316
5  1.396336 -0.595659 -0.090335  0.048473 -0.240667

In [155]:
df['C']

1   -1.280079
2   -0.776509
3   -0.056867
4   -1.241567
5   -0.090335
Name: C, dtype: float64

In [156]:
df[['D','B']]

          D         B
1  0.453169 -0.784681
2 -0.120699 -0.269612
3  0.482628 -0.649172
4  0.921067  0.551059
5  0.048473 -0.595659

In [157]:
df[['A','C']]

          A         C
1  0.913668 -1.280079
2 -0.548434 -0.776509
3  0.710297 -0.056867
4 -0.579512 -1.241567
5  1.396336 -0.090335

In [158]:
type(df[['A','C']])
type(df[['D','B']])

pandas.core.frame.DataFrame

In [159]:
df['F'] = df['A'] + df['B']

In [160]:
df

          A         B         C         D         E         F
1  0.913668 -0.784681 -1.280079  0.453169  0.538182  0.128988
2 -0.548434 -0.269612 -0.776509 -0.120699 -0.454400 -0.818045
3  0.710297 -0.649172 -0.056867  0.482628 -0.778616  0.061125
4 -0.579512  0.551059 -1.241567  0.921067 -0.750316 -0.028454
5  1.396336 -0.595659 -0.090335  0.048473 -0.240667  0.800676

In [161]:
df.drop('F',axis = 1)

          A         B         C         D         E
1  0.913668 -0.784681 -1.280079  0.453169  0.538182
2 -0.548434 -0.269612 -0.776509 -0.120699 -0.454400
3  0.710297 -0.649172 -0.056867  0.482628 -0.778616
4 -0.579512  0.551059 -1.241567  0.921067 -0.750316
5  1.396336 -0.595659 -0.090335  0.048473 -0.240667

In [162]:
df

          A         B         C         D         E         F
1  0.913668 -0.784681 -1.280079  0.453169  0.538182  0.128988
2 -0.548434 -0.269612 -0.776509 -0.120699 -0.454400 -0.818045
3  0.710297 -0.649172 -0.056867  0.482628 -0.778616  0.061125
4 -0.579512  0.551059 -1.241567  0.921067 -0.750316 -0.028454
5  1.396336 -0.595659 -0.090335  0.048473 -0.240667  0.800676

In [163]:
df.drop('F',axis = 1, inplace = True)

In [164]:
df

          A         B         C         D         E
1  0.913668 -0.784681 -1.280079  0.453169  0.538182
2 -0.548434 -0.269612 -0.776509 -0.120699 -0.454400
3  0.710297 -0.649172 -0.056867  0.482628 -0.778616
4 -0.579512  0.551059 -1.241567  0.921067 -0.750316
5  1.396336 -0.595659 -0.090335  0.048473 -0.240667

In [165]:
df.loc['3']

A    0.710297
B   -0.649172
C   -0.056867
D    0.482628
E   -0.778616
Name: 3, dtype: float64

In [166]:
df.iloc[2]

A    0.710297
B   -0.649172
C   -0.056867
D    0.482628
E   -0.778616
Name: 3, dtype: float64

In [167]:
df.loc[['1','2'],['A','B']]

          A         B
1  0.913668 -0.784681
2 -0.548434 -0.269612

In [168]:
df >0

       A      B      C      D      E
1   True  False  False   True   True
2  False  False  False  False  False
3   True  False  False   True  False
4  False   True  False   True  False
5   True  False  False   True  False

In [169]:
df < 0

       A      B     C      D      E
1  False   True  True  False  False
2   True   True  True   True   True
3  False   True  True  False   True
4   True  False  True  False   True
5  False   True  True  False   True

In [170]:
df > 1

       A      B      C      D      E
1  False  False  False  False  False
2  False  False  False  False  False
3  False  False  False  False  False
4  False  False  False  False  False
5   True  False  False  False  False

In [171]:
df[df>0]

          A         B   C         D         E
1  0.913668       NaN NaN  0.453169  0.538182
2       NaN       NaN NaN       NaN       NaN
3  0.710297       NaN NaN  0.482628       NaN
4       NaN  0.551059 NaN  0.921067       NaN
5  1.396336       NaN NaN  0.048473       NaN

In [172]:
df[df['A'] > 0]

          A         B         C         D         E
1  0.913668 -0.784681 -1.280079  0.453169  0.538182
3  0.710297 -0.649172 -0.056867  0.482628 -0.778616
5  1.396336 -0.595659 -0.090335  0.048473 -0.240667

In [173]:
df.interpolate()

          A         B         C         D         E
1  0.913668 -0.784681 -1.280079  0.453169  0.538182
2 -0.548434 -0.269612 -0.776509 -0.120699 -0.454400
3  0.710297 -0.649172 -0.056867  0.482628 -0.778616
4 -0.579512  0.551059 -1.241567  0.921067 -0.750316
5  1.396336 -0.595659 -0.090335  0.048473 -0.240667

In [174]:
df [(df['A']>0) & (df['D']>0)]

          A         B         C         D         E
1  0.913668 -0.784681 -1.280079  0.453169  0.538182
3  0.710297 -0.649172 -0.056867  0.482628 -0.778616
5  1.396336 -0.595659 -0.090335  0.048473 -0.240667

In [178]:
A = df.reset_index()

In [176]:
df

          A         B         C         D         E
1  0.913668 -0.784681 -1.280079  0.453169  0.538182
2 -0.548434 -0.269612 -0.776509 -0.120699 -0.454400
3  0.710297 -0.649172 -0.056867  0.482628 -0.778616
4 -0.579512  0.551059 -1.241567  0.921067 -0.750316
5  1.396336 -0.595659 -0.090335  0.048473 -0.240667

In [179]:
A

  index         A         B         C         D         E
0     1  0.913668 -0.784681 -1.280079  0.453169  0.538182
1     2 -0.548434 -0.269612 -0.776509 -0.120699 -0.454400
2     3  0.710297 -0.649172 -0.056867  0.482628 -0.778616
3     4 -0.579512  0.551059 -1.241567  0.921067 -0.750316
4     5  1.396336 -0.595659 -0.090335  0.048473 -0.240667

In [180]:
B= "AA BB CC DD EE".split()
B

['AA', 'BB', 'CC', 'DD', 'EE']

In [181]:
df['index'] = B

In [182]:
df

          A         B         C         D         E index
1  0.913668 -0.784681 -1.280079  0.453169  0.538182    AA
2 -0.548434 -0.269612 -0.776509 -0.120699 -0.454400    BB
3  0.710297 -0.649172 -0.056867  0.482628 -0.778616    CC
4 -0.579512  0.551059 -1.241567  0.921067 -0.750316    DD
5  1.396336 -0.595659 -0.090335  0.048473 -0.240667    EE

In [183]:
df.set_index("index")

              A         B         C         D         E
index
AA     0.913668 -0.784681 -1.280079  0.453169  0.538182
BB    -0.548434 -0.269612 -0.776509 -0.120699 -0.454400
CC     0.710297 -0.649172 -0.056867  0.482628 -0.778616
DD    -0.579512  0.551059 -1.241567  0.921067 -0.750316
EE     1.396336 -0.595659 -0.090335  0.048473 -0.240667

# Multi - Index and Index Hierarchy

In [191]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [192]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [195]:
df = pd.DataFrame(np.random.randn(6,2), index = hier_index, columns = ['A','B'])
df

             A         B
G1 1  0.005772  0.208362
   2  0.030225  1.076249
   3 -0.804916  0.578374
G2 1  1.069088 -1.091840
   2 -2.198515  0.538906
   3  0.511715 -0.578169

In [196]:
df.loc['G1'].loc[1]

A    0.005772
B    0.208362
Name: 1, dtype: float64

In [197]:
df

             A         B
G1 1  0.005772  0.208362
   2  0.030225  1.076249
   3 -0.804916  0.578374
G2 1  1.069088 -1.091840
   2 -2.198515  0.538906
   3  0.511715 -0.578169

In [198]:
df.index.names = ["Group", "Num"]
df

                  A         B
Group Num
G1    1    0.005772  0.208362
      2    0.030225  1.076249
      3   -0.804916  0.578374
G2    1    1.069088 -1.091840
      2   -2.198515  0.538906
      3    0.511715 -0.578169

In [200]:
df.xs(["G1",1])

C:\Users\Computer\AppData\Local\Temp\ipykernel_8588\4181962490.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df.xs(["G1",1])

A    0.005772
B    0.208362
Name: (G1, 1), dtype: float64

In [201]:
df.xs(1, level = "Num")

              A         B
Group
G1     0.005772  0.208362
G2     1.069088 -1.091840

In [202]:
df

                  A         B
Group Num
G1    1    0.005772  0.208362
      2    0.030225  1.076249
      3   -0.804916  0.578374
G2    1    1.069088 -1.091840
      2   -2.198515  0.538906
      3    0.511715 -0.578169